[
    {
        "level_number": 0,
        "title": "Introducción a Arrays",
        "pattern": "^let\\s+stack\\s*=\\s*\\[\\];$",
        "hints": [
            "Recuerda usar 'let' para declarar variables.",
            "Los arrays vacíos se simbolizan con <code>[]</code>."
        ],
        "steps": [
    {
        "step_number": 0,
        "title": "¡Bienvenido a Array Cat!",
        "content": "Aquí aprenderás los conceptos básicos de los arrays de una forma divertida y práctica. Prepárate para convertirte en un maestro organizando elementos. ¡Empecemos!"
    },
    {
        "step_number": 1,
        "title": "Manual de instrucciones",
        "content": "Este manual será tu mejor amigo durante el juego. Aquí encontrarás pistas y explicaciones para superar los retos. <br><br> -> Puedes consultarlo en cualquier momento si necesitas ayuda o te sientes perdido. ¡No dudes en usarlo!"
    },
    {
        "step_number": 2,
        "title": "Área de input",
        "content": "Para dar órdenes al sistema, necesitas usar el <span style='color: blue;'>área de input</span>. Aquí escribirás tus comandos para interactuar con el juego."
    },
    {
        "step_number": 3,
        "title": "Creando un stack",
        "content": "Necesitamos un lugar donde apilar las frutas. Para esto, crearemos un stack usando el comando: <code>let stack = [];</code>. Un stack es simplemente un array vacío donde puedes almacenar elementos."    }
    
        ]
    },
    {
        "level_number": 1,
        "title": "Manipulación Básica de Arrays",
        "pattern": "stack.push(cherry);",
        "hints": [
                "Un stack es como un contenedor donde puedes guardar cosas.",
                "Los arrays en JavaScript se simbolizan con <code>[]</code>."
                ],
        "steps": [
            {
                "step_number": 0,
                "title": "Muy bien! haz creado tu primer array",
                "content": "Ahora veamos una breve explicacion de que sucedió...."
            },
            {
                "step_number": 1,
                "title": "¿Qué es un stack? (Parte 1)",
                "content": "Imagina que tienes muchas pelotas de tenis y necesitas guardarlas para que no se pierdan. Las colocas en un recipiente, y problema resuelto. Ese recipiente es un <b>array</b>, simbolizado por <code>[]</code>. Aquí en la fábrica, lo llamamos <i>stack</i>."
            },
            {
                "step_number": 2,
                "title": "¿Qué es un stack? (Parte 2)",
                "content": "Una vez tienes el recipiente, necesitas poder agregar, quitar y organizar los elementos dentro de él. En JavaScript, hacemos lo mismo con un array. <br><br> Usa el comando <code>stack.push('cherry');</code> para agregar una cereza al stack."
            },
            {
                "step_number": 3,
                "title": "Eliminando un elemento",
                "content": "Elimina el último elemento del array usando pop."
            },
            {
                "step_number": 4,
                "title": "Accediendo a un elemento",
                "content": "Accede al segundo elemento del array usando índices."
            }
        ]
    }
]
